In [1]:
from pandas import DataFrame

In [2]:
dframe = DataFrame({'city':['Alma','Brian','fox'],
                   'altitude':[3121,2222,1414]})

In [3]:
dframe

    city  altitude
0   Alma      3121
1  Brian      2222
2    fox      1414

In [4]:
state_map = {'Alma': 'Colorado', 'Brian':'Utah','fox': 'Wyoming'}

In [5]:
dframe['state'] = dframe['city'].map(state_map)

# 新しい列が追加させている
# cityを元にマッピングしている

In [6]:
dframe

    city  altitude     state
0   Alma      3121  Colorado
1  Brian      2222      Utah
2    fox      1414   Wyoming